{
    "dash": {
        "name": "Dash",
        "description": "A unit with this skill may attack after moving on the same turn.",
        "code": "da"
    },
    "escape": {
        "name": "Escape",
        "description": "A unit with this skill may move after attacking on the same turn.",
        "code": "es"
    },
    "carry": {
        "name": "Carry",
        "description": "A unit with this skill may travel on water (and ocean if navigation is researched), and will transform into the unit it is carrying if it moves onto land. Units with this skill are formed when a land unit moves onto a port.",
        "code": "ca"
    },
    "scout": {
        "name": "Scout",
        "description": "A unit with this skill un-fogs tiles in a 2 tile radius around it rather than the usual 1.",
        "code": "sc"
    },
    "crush": {
        "name": "Crush",
        "description": "A unit with this skill will destroy any units or buildings on any tile it moves onto.",
        "code": "cr"
    },
    "persist": {
        "name": "Persist",
        "description": "A unit with this skill may attack another unit on the same turn after successfully killing a first unit. This may be repeated indefinitely.",
        "code": "pe"
    },
    "convert": {
        "name": "Convert",
        "description": "A unit with this skill will convert enemy units to its own tribe instead of attacking.",
        "code": "co"
    },
    "heal": {
        "name": "Heal",
        "description": "A unit with this skill will restore 4 health to all units adjacent to it, giving target units no more than their maximum health.",
        "code": "he"
    },
    "swim": {
        "name": "Swim",
        "description": "A unit with this skill may travel on water, land or ocean. They may only travel on water if they have sailing or riding researched, and ocean with navigation or free diving. They have a movement of 1 on land.",
        "code": "sw"
    },
    "grow": {
        "name": "Grow",
        "description": "A unit with this skill will grow into another unit after a certain number of turns.",
        "code": "gr"
    },
    "fly": {
        "name": "Fly",
        "description": "A unit with this skill will always be able to move up to their movement limit, without being influenced by terrain (but also not by roads). They also unfog tiles in a 5 by 5 area, as if they had the scout ability, but may not capture cities, or villages, and may not examine ruins.",
        "code": "fl"
    },
    "splash": {
        "name": "Splash",
        "description": "When a unit with this skill attacks, all enemies adjacent to the attack are hit for just over half the damage dealt to the target.",
        "code": "sp"
    },
    "navigate": {
        "name": "Navigate",
        "description": "A unit with this skill may travel on the ocean even when navigation is not researched.",
        "code": "na"
    },
    "freeze": {
        "name": "Freeze",
        "description": "Instead of attacking their targets, units with this skill will freeze them, preventing them from retaliating, moving, attacking or performing any other action for one turn.",
        "code": "fr"
    },
    "freeze_area": {
        "name": "Freeze Area",
        "description": "Units with this skill will have the option to use it instead of attacking, which will freeze all adjacent units (see the \"freeze\" ability) and freeze all adjacent tiles (including the one the unit is on). When tiles are frozen, water and ocean is converted to ice, and land is converted to Polaris-themed land. Land in enemy territory cannot be frozen.",
        "code": "fa"
    },
    "auto_freeze": {
        "name": "Auto Freeze",
        "description": "Units with this skill will automatically \"freeze area\" every turn.",
        "code": "af"
    },
    "skate": {
        "name": "Skate",
        "description": "Units with this ability will have double movement on ice tiles, but on land tiles will have only 1 movement, and lose dash and escape abilities.",
        "code": "sk"
    },
    "fortify": {
        "name": "Fortify",
        "description": "Units with this ability will gain a defence bonus from cities.",
        "code": "fo"
    }
}