{
    "categories": {
        "1": "Sign-ups",
        "2": "Games Invitations",
        "3": "Scoring",
        "4": "In-game Rules",
        "5": "Diplomatic Rules",
        "6": "Time Limit & Glitches",
        "7": "Submitting Results",
        "8": "Division Structure"
    },
    "rules": {
        "1.1": "To sign up, you have to complete and submit the (Re-)Inscription Form at https://form.discord.giantsleague.com/. For that you need the access code provided in #registration-announcements at the end of the previous season.\nIt is strongly suggested that your ingame name is the same as your discord (nick-)name.\nAlso please inform us when you change you ingame name or your discord name to avoid confusion.\nNote that you will have to play with the MOBILE VERSION of Polytopia if you want to participate",
        "1.2": "Once the inscription process is complete, you will gain access to your division's channel and your Division Sheet of the Google Document at http://discord.giantsleague.com/ (The link can also be found in #season-announcements).",
        "1.3": "The Division Channel is where you need to post/discuss with your opponents about alliances, delays in game, glitches and other problems before reaching out to a MOD.\nNote that any in-game map screenshot is NOT ALLOWED to be shown in any channel or by any other means. They should only be sent in private to MODs to resolve problems. Any player showing a screenshot to any other player (except privately to a MOD to resolve a problem) will get up to 5 points penalty.",
        "1.4": "Use #time-out-glitches-and-breaks of your Division Category in Discord to discuss delays in games, glitches and breaks. Do not use the specific game channels to discuss those three subjects if you want them to count officially.",
        "1.5": "The games played within this league should be prioritized over any other games for three reasons: It's a league, it has an ending date and you have 7 other players waiting for you to play your turn.",
        "1.6": "Please try to avoid changing your Polytopia name and your Discord name during the Season. If you absolutely have to do it, please inform a MOD.",
        "2.1": "At the start of the Season (before the deadline announced in #season-announcements or in your Division Sheet of the Google Document), each player has to send and accept Friend Requests to/from all other players in their Division and create their game once all Friend Requests have been accepted. As you send Friend Requests, if more than one person in the game has the same Polytopia name of one of your opponents, just ask that player to show a screenshot of its avatar to avoid any confusion.\nNote that a total of 8 games will be played per Division per Season.\nIf players want, they can choose a thematic name for their games, but that's totally up to the group.",
        "2.2": "Matches are:\n        - Game Mode: Might\n        - Map Type: Lakes, Continents and Archipelago\n        - Map Size: Large (324 tiles) or Huge (400 tiles)\n        - Turn Time Limit: 1 Day\n        - 8 players FFA without any bots\n        - No Disabled Tribe",
        "2.3": "You MUST respect the order of the invitations of each player (see your Division Sheet of the Google Document).\nNote that once you started a game, you will have to rename the name of the Division Channel (#game-X by default depending on the number of the game you host in the google sheet) to the name of the game you created in Polytopia (With the command g!rename NAMEOFGAME in the respective Channel) and enter the name and map size of the game you host in the blue section of your Division Sheet in the Google Document.",
        "2.4": "All Class #1 and Class #2 Tribes (Bardur, Luxidoor, Kickoo, Zebasi, Imperius and Cymanti) can only be picked once per player over the course of all 8 games.\nEx:\n```\nGame #:   1, 2, 3, 4, 5, 6, 7, 8          1, 2, 3, 4, 5, 6, 7, 8\n    Ok:   B, L, K, Z, I, E, C, V(engir);  V, V, V, V, V, V, V, V\nNot Ok:   B, B, L, K, Z, I, E, C;         B, B, B, B, B, B, B, B```\nEach faulty tribe pick will give a 5 points penalty.\n*Note that different players picking the same tribe in a single game is not a problem.*",
        "2.5": "For every different Class #4 Tribe (Hoodrick, Quetzali, Ai-Mo, Vengir and Oumaji) you have selected and for every Class #1 Tribe (Bardur, Kickoo and Imperius) you have not selected, you will receive one bonus point.\nSo there is a potential of 8 bonus points.\nHere is a table showing the classification of all the Tribes and their restriction and bonus status:\nhttps://cdn.discordapp.com/attachments/667409158806437922/930928602869026826/Capture.PNG",
        "2.6": "If the game parameters are not respected (Mode, Type, Size, Time Limit, Bots, Disabled Tribes or Turn Order), the game will be considered invalid and will have to be restarted before the end of turn 1. After turn 1, please refer to a MOD for further instructions. They will make the decision regarding a restart. Some penalty might be applied.",
        "2.7": "If a player has not sent and accepted any Friend Requests by the deadline, they will be considered as Dropped Out. If they have only partially sent and accepted any Friend Requests by the deadline, they may be granted some extra time to do so, but penalties may be applied.",
        "2.8": "If a player doesn't host his or her game by the deadline (for other reasons than their Friend Requests not being accepted), that game will still be played in the same order (except without the Dropped Out player).\nNote that the player who was second in the turn order of that game will become the host of the game. All other games will be played normally (the Dropped Out player will eventually get Kicked by someone in the other games). So a total of 8 games will still be played, but one of them with only 7 players.  The Dropped Out player will be considered as Kicked Out at turn -1 for the game he or she didn't host. Contact MODs if you see that a player has not hosted their game (or sent and accepted Friend Requests) after the deadline and does not respond to pings (with an @ before the Discord name).",
        "2.9": "If more than one player doesn't host their game by the deadline (for other reasons than their Friend Requests not being accepted), new players will be recruited to replace them. All games already started will be restarted with the new players. Contact MODs as soon as possible if you see that more than one player has not hosted their game (or sent and accepted Friend Requests) after the deadline and do not respond to pings (with an @ before the Discord name).",
        "3.1": "Win/Loss Types: \n    Winner:    Win the game by conquering all capitals. \n    Conquered:    Lose the game by losing all your cities. \n    Resigned:    Lose the game by resigning before getting conquered by opponents. \n    Kicked Out:    Lose the game by getting kicked out by an opponent.\n    Surviving: The game ends and you are still standing, but you are not the Winner.",
        "3.2": "Points: \nPoints given per finishing positions: \nPositions:        1,  2, 3, 4, 5, 6, 7, 8\nPoints given:  8, 6, 5, 4, 3, 2, 1, 0\nPoints per kill: 1pt\nPoints per Tribe in Class #1 that has not been picked: 1pt\nPoints per different Tribe picked in Class #4: 1pt\nBeing Kicked Out: -1pt\nSlow down the games invitation process: up to -2pts\nKicking out someone that is not KOS or Skip Turn of someone in break (See rule 6): up to -5pts\nKicking out someone when you are already eliminated from a game: up to -10pts\nShowing a screenshot of a game (or telling specific intel): up to -5pts\nTeaming up with 2 or more other players in a game: up to -5pts\nTrying to make a private deal with another player or try to cheat: up to -10 pts\nNot respecting the Tribe pick conditions: -5pts per faulty tribe\n*Note that this way the Winner could get a maximum of 15 points per game, if he kills all the opponents.\nAlso note that if you don't like being the \"hostage\" of a player (normally the leader of a game) trying to decide the finishing positions of the remaining players, you can always resign to force your elimination. It is probably the most honorable thing to do, but ultimately, it is up to you to make that decision.*",
        "3.3": "If a player had previously Resigned or got Kicked Out from the game and you eliminate the Bot of that player left within the game, the kill still counts. In this case, the turn to be entered is the one when the player resigned or got kicked out. You only need to update the Killer information once the Bot is killed.",
        "3.4": "If a game ends and there are still Surviving players, no one can claim the kill of those players.",
        "3.5": "You cannot claim a kill as a Bot (if you already were Kicked out or decided to Resign).",
        "3.6": "Tie Break Rules: \nMost Victories (1st place) \nMost Killed Opponents\nMost Second Places\nMost Third Places\nMost Different Tribes Used\nMost Fourth Places\nMost Fifth Places\nMost Sixth Places\nMost Seventh Places\nSmallest number of penalties (other than being Kicked out) \nSmallest number of Kicked out games\nSmallest number of Resigned games\nIf none of the conditions mentioned above can determine a Winner, a tie-breaking game will be played. It will be played on a small map, no bots, with only the tied players involved. The starting player and the turn order will be determined randomly by the MODs.",
        "4.1": "If a player owns less than 9 tiles around his or her capital, the game will be eligible for a restart. If you want to claim that restart, you must send a screenshot (in private) to a MOD before the end of turn 0.",
        "4.2": "If a player is on a one city island and has no place to put a port without having to do a border growth (except for Polaris) or if the only spots to place ports without Border Growth lead to a sea that doesn't connect to other cities (except for Polaris), the game will be eligible to a restart. If you want to claim that restart, you must send a screenshot (in private) to a MOD before the end of turn 5.\nNote: At the end of turn 5, if the possibility is still there, but the island has not been totally explored yet, send your screenshot to a MOD anyway. They will evaluate if you have made a sufficient effort to explore the island to warrant an extension of the 5 turn limit to claim the restart.",
        "4.3": "If you were conquered (and someone claimed the kill), you are considered eliminated at the turn the player eliminated you. Otherwise, you will be considered eliminated at the beginning of your turn. \nNote: If you want to resign, you should do it on your turn. Also, if you plan on killing another player on your turn, you should not resign on that turn.",
        "4.4": "If multiple players are eliminated by the same player on the same turn (and the kills are claimed), the play order of that game will take predominance\nEx: If the second, fourth and sixth player get eliminated by the same player on the same turn, the second player will have the lowest finishing position of the three players (he or she played first and is considered eliminated before the other two).",
        "4.5": "If the game ends and there is more than one Surviving player, the play order of that game will take predominance for the remaining Surviving players (see example rule 4.4).",
        "5.1": "Diplomacy and alliances are allowed between players during gameplay. If you want to make a deal with another player, you have to do it PUBLICLY IN YOUR DIVISION CHANNELS.\nNote that \"deal\" is a pretty wide term. An alliance (working together, a NAP (Non-Aggression Pact) or any other sort of arrangement between two players are considered being \"deals\"",
        "5.2": "You can have a deal with only one player at a time per game, if this is not respected, you risk a penalty of up to 5 points.\nNote that any player can use the Diplomatic Deals Input Table of your Division Sheet to keep track of any deals made between any players. There is no obligation to make sure this Table is up to date, it's just a tool anyone can use to keep track of all the deals if they want to.",
        "5.3": "Any deal can be broken at any time without warning.\nNote that this implies you can change allies throughout the game as long as you never have more than one at a time.",
        "5.4": "Any in-game map screenshot is NOT ALLOWED to be shown in any Channel or by any other means. They should only be sent in private to MODs to resolve problems. Any player showing a screenshot to any other player (except privately to a MOD to resolve a problem) will get up to 5 points penalty.",
        "5.5": "Do not discuss direct in-game information such as: Types of units, amounts, positions and villages.\nEX:\n:white_check_mark:: \"Help me with Zebasi\" or \"I go west, you go east\" or \"Be careful around Hoodrick\"\n:x:: \"Kill Zebasi's catapults here with your knight\" or  \"You take that village 3 tiles east to your warrior\" or \"Beware, Hoodrick has giants\" or \"Don't go there, you will be crushed by catapults\" or \"Bring that unit down to 6 HP so I can finish it off.\" or \"You should grow a forest there.\"\nThe idea is to avoid giving information to other players (allied or not) that they normally would not have access to. If you tell this kind of specific intel in the Division Channels, you might get up to -5 pts penalty.\nAlso you are free to tell information about yourself if you want to, but only yourself and make sure to still respect rule 5.4 (so no screenshot sharing, even if you are the only one in it).",
        "5.6": "Any player that has been proven to try to contact another player privately to make a deal will get up to 10pts penalty. \nNote that we obviously have no way to know for certain if players make deals in private. We count on you to exercise fairplay and not to cheat the rules. If you ever receive a private message from another player trying to make a deal with you, please contact a MOD. If you don't report to a MOD, you will be considered as guilty as the player trying to contact you privately.",
        "5.7": "If two players have been proven to make private deals, heavier penalties will be applied. Depending on the situation, you might even get banned from the League.",
        "5.8": "It is totally possible that two players don't attack each other even without an official deal. In other words, in-game behavior does not count as proof of two players having a private deal.",
        "5.9": "Any sort of alliance is tolerated (as long as it's limited to one at a time per player per game), but please try to be fair in the deals you make. We want the games to be as fair and as fun as possible.",
        "6.1": "Every player is allowed 24 hours to play his turn (default time fixed for all games). Whenever a player is Timed Out, any player can Skip their Turn instantly. Warnings can obviously be given before Skipping, but that will be up to the players to decide.\nIf you want your warning to be considered official, you must ping the Timed Out player, with a screenshot showing he or she is timed out, in #time-out-glitches-and-breaks of your Division Category in Discord (not in the specific game Channels or the general Channel).\n*Note that you can still give an unofficial Warning in the specific game Channel or in the general Channel (or in #time-out-glitches-and-breaks without screenshot) if you want, but it won't be considered as an official Warning. so it won't count towards KOS (Kick Out on Sight).*",
        "6.2": "If a player has officially been warned at least two times for being Timed Out (in total, mot per game - timing out in more than one game at the same time does not count as more than one Time Out), contact MODs. They will decide if the Timed Out player will be considered as \"Kick Out on Sight\" (KOS). If this happens, whenever this player is Timed Out again, any player still alive in that game can Kick them Out without any Warning. \n*Note that the name of a player marked as KOS will be in yellow with a red background in your Division Sheet of the Google Document. That player will also be warned in <#826463874282815528> of the FOLLOW-UP Category in Discord and receive the \"Kick Out on Sight\" Role.",
        "6.3": "If you're kicked out, this counts as -1 points for scoring.",
        "6.4": "If you Kick Out someone that is not KOS, you can get up to 5pts penalty.\nNote that players that have been Kicked Out  \"illegally\" will be considered as Resigned. If that happens, you should take a screenshot of the message showing the name of the player that Kicked you Out.",
        "6.5": "In the event of a glitch, MODs will make the decision to pursue or restart the game. After turn 10, no game will be allowed a restart due to a glitch unless ALL players in that Division agree to and MODs allow it. If the game has not been restarted, the Kicked Out player (if needed) will be considered as Resigned at the turn they were Kicked Out. MODs may ask for proof if you claim you were Kicked Out due to a glitch.",
        "6.6": "If you think you might time out, ping your Division Role in #time-out-glitches-and-breaks of your Division Category in Discord to notify your opponents that you won't have time to play for some time (ideally with a specific period of time, maximum of 3 days). Then people aren't allowed to Kick or Skip you when you time out. If you're still not back after 3 days or your specified time period, people are allowed to kick you again. This break can only be taken once per season.\nEx: @​Division 3D I have to work on a project, so I won't be able to play for the next two days, sorry for the inconvenience.\n*Note that players in the same Division of a player in break will be warned in <#826463873297022976> of the FOLLOW-UP Category in Discord and temporarily receive the \"In Break - Do Not Kick Out\" Role.",
        "6.7": "Until the deadline to create your game is reached (mentioned in #season-announcements and in your Division Sheet), no one can Kick Out another player at the tribe selection phase (turn -1). If this happen the game will be restarted.\nNote that once the deadline is reached, normal time limit rules will be applied. So a player that is not ready to start playing before the official start date of the season should simply not select his tribe. Once the turn 0 has begun (map created) the game is considered officially started and normal time limit rules will be applied. A player that was Kicked Out at the tribe selection phase (after the deadline), will be considered as Kicked Out at turn -1.",
        "6.8": "Seasons will be limited to 13 weeks after the start date (mentioned in #season-announcements and your Division Sheet). If some games are not finished by then, MODs will decide on a final turn to finish those games. The final positions for these games will be decided with the Giants League Score (GLS). If you are in this situation, you will have to send screenshots of the game and of the Polytopia Game Stats Menu at the end of your turn of that specific final turn fixed by MODs. Further instructions will be given to you on the #season-announcements. Here are more details on how the GLS is calculated:\n\nhttps://cdn.discordapp.com/attachments/667409158806437922/787693820358688818/GLS.png\nNote that no kill will be awarded and players will be considered as Surviving (except the Winner). Alliances will not be taken into account. Players that do not send their screenshots risk ending in a worse position than they would have normally deserved due to the fact that MODs can't clearly have a full view of their situation. If no screenshots are given, MODs will make a decision with the info they have (which may be pretty random at this point...).",
        "7.1": "Just after hosting your game, you must rename the name of the Division Channel related to that game (#game-X by default depending on the game number of the game you host) to the name of the game you created in Polytopia (With the command g!rename NAMEOFGAME in the respective Channel) and enter the name and map size of the game you host in the blue section of your Division Sheet.",
        "7.2": "Players must enter the Tribe they selected, the Win/Loss type, the killer and on what Turn they got eliminated when they get eliminated from a game (or anytime before that for the Tribe selected)  in the green section of your Division Sheet.\nNote that at any time in the game anyone that knows what tribe you chose can input it for you.\nAlso note that the longer you take to input your Tribe the less plausible it becomes for you to correct a potential mistake regarding the Tribe Selection.",
        "7.3": "The turn you must input is the one when the killer captures the last city of the eliminated player(aka when the killer gets the elimination popup) and NOT the turn where they move a unit into that last city to capture it.",
        "7.4": "Since the killer is the best candidate to fill these 4 infos, it is recommended for them to fill the info for the killed player. But ultimately it is each player's responsibility to make sure their own data is filled properly.",
        "7.5": "The player who Kicks another player should be the on who writes down the info for that player. But same as before still applies.\nNote that when a player is Kicked Out or Resigned, as long as the bot is still alive, the killer should be marked with a \"?\". You should only use \"N/A\" for the Winner of a game, Surviving players or when a player got eliminated by a bot.",
        "7.6": "When you eliminate an opponent (or the bot representing them) from a game, you need to input your name in the \"Killed by\" column of the player you killed. If that opponent has already Resigned or been Kicked, you still input your name in the \"Killed by\" column, but you DON'T change the Turn number. If you want your kill points it is ultimately your responsibility to claim them",
        "7.7": "It is your responsibility to fill in the Division Sheet with the right information. If some information you filled is confirmed by other players to be false, MODs will make a decision. Depending on the situation, you may get some penalty points or in extreme cases even get banned from the League.\nIt is strongly suggested to take screenshots to prove the information you fill in your division page of this document so that you have some evidence in case of a dispute. Therefore, we highly recommend to take a screenshot of the turn whenever you eliminate someone or just before you lose your last city.\nHere is an example of screenshots you should take to prove a kill:\n(As for the screenshot to prove the turn you got eliminated, taking the one with the Polytopia Game Stats Menu (like the one on the right) the turn just before you think you will lose your last city is sufficient.\nhttps://cdn.discordapp.com/attachments/667409158806437922/787693813874294844/mini_shit_examples_pictures.png",
        "7.8": "For any reason they see fit, MODs can ask any player to confirm a kill they claimed with a screenshot",
        "7.9": "If a game is finished and some information is missing, admins will try to figure out the missing information of that player by asking to the players of the division on Discord. In the event that the information cannot be retrieved or no consensus can be established by the group, the missing information will be replaced by resigned at turn -1.",
        "8.1": "At the end of the Season, the top 2 players at the end of the season will be promoted to a higher league, unless they are part of League 1 already.\nNote that if Division 3E is played (when there are between 64 and 88 players), only the Winners of the Divisions from League 3 will automatically be promoted to League 2.",
        "8.2": "The bottom 4 players will be relegated to a lower League (unless they are already at the lowest League)",
        "8.3": "If after all promotions were made there are still Leagues that were not completed (because of players not rejoining or because there is not an optimal number of Divisions), the missing spots will be filled by players from the League just below (including freshly relegated and promoted players).\nNote that players with the most points last Season will be recruited first (with the same tie break rules if needed).\nAlso 60, 40 and 10 points will be subtracted from each player's score of the last Season if they were playing in League 4, 3 or 2 respectively.\nEx: Players from League 1 that were relegated to League 2 will have a 10 pts adcantage over players from League 2 that stayed in League 2 and a 40 points advantage over players that just got promoted to League 2 from League 3. Players from League 2 that stayed in League 2 will have a 30 points advantage over players that just got promoted to League 2 from League 3.",
        "8.4": "New players to the League will start at the lowest League.",
        "8.5": "Players that left in a previous Season and rejoin the League will be considered as new players.",
        "8.6": "If there are not enough rejoining players to fill the top Leagues (other than the lowest League), the new players with the highest overall (Facebook and Discord combined) TPS (total Points per Season), will be recruited first. Otherwise it is first come, first serve.\nNote that a player who has never played in the Giants League is considered having 0 TPS.\nYou will find more details on the Division Structure and Relegation Process at https://dsr.giantsleague.com/"
    }
}
